Repository: omniaezz/TechStore
Catalog: TechStore.ViewUser/Resources/Views/Shared/_Layout.*.resx
Languages: ar_eg

source: Accessories
ar_eg: اكسسوارات

source: Apple
ar_eg: ابل

source: Ariston
ar_eg: أريستون

source: Babyliss
ar_eg: بيبي ليس

source: Braun offers
ar_eg: عروض براون

# Call
source: Call 19966
ar_eg: اتصل علي 19966

source: CallSupport
ar_eg: اتصل بنا

source: Cart
ar_eg: مشترياتي

source: Categories
ar_eg: فئات

source: Connect withus
ar_eg: تواصل معنا

source: Download The TECHSTORE App
ar_eg: نزل تطبيق تك ستور

source: Everyday Deals
ar_eg: عروض كل يوم

source: Indesit
ar_eg: إنديست

source: Laptop
ar_eg: لاب توب

source: Logout
ar_eg: تسجيل خروج

source: Miele
ar_eg: ميلا

source: Minicash
ar_eg: تقسيط الميني كاش

source: Mobile
ar_eg: الموبايل

# Mobile&amp;Tablet
source: Mobile & Tablet
ar_eg: موبايل و لابتوب

source: My Account
ar_eg: حسابي

source: My deliver yarea: Cairo
ar_eg: منطقة التوصيل : القاهرة

source: Oppo
ar_eg: اوبو

source: Samsung
ar_eg: سامسونج

source: Screens
ar_eg: شاشات

source: Search For Products Orbrands
ar_eg: ابحث في المنتجات أو ماركات

source: Sell on TECH Stoer
ar_eg: بيع على تك ستور

# SmartWatch
source: Smart watches
ar_eg: ساعات ذكية

source: TECHSTORE services
ar_eg: خدمات تك ستور

source: TECHSTORE warranty
ar_eg: بضمان تك ستور

# Terms&amp;Conditions
source: Terms & Conditions
ar_eg: الشروط والأحكام

source: Trending now
ar_eg: عليه طلب

source: TVs
ar_eg: تلفزيونات

source: Ultra
ar_eg: الترا

source: ©TECHSTORE For Trade And Distribution, AllRights Reserved
ar_eg: .جميع الحقوق محفوظة لشركة تك ستور للتجارة و التوزيع
